tap "homebrew/bundle"

# brew "mas" # Uncomment If I ever want to install apps from the Mac App Store

brew "fzf" # Fuzzy finder
brew "gh" # GitHub CLI
brew "git" # Git
brew "pyenv" # Python version manager
brew "tfenv" # Terraform version manager

cask "aldente" # Battery management
cask "stats" # System monitoring
cask "visual-studio-code"
cask "shottr"   # Screenshot utility
cask "rectangle" # Window manager
cask "scroll-reverser" # To allow for natural scrolling on trackpad, but not on mouse


# VS Code Extensions
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "ms-vscode-remote.remote-containers"
vscode "me-dutour-mathieu.vscode-github-actions"

vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "redhat.vscode-yaml"
vscode "yzhang.markdown-all-in-one"
