tap "homebrew/bundle"

# brew "mas" # Uncomment If I ever want to install apps from the Mac App Store

brew "fzf" # Fuzzy finder
brew "gh" # GitHub CLI
brew "git" # Git
brew "uv" # Python version and package manager
brew "tfenv" # Terraform version manager
brew "gpg2" # GPG
brew "gnupg" # GPG
brew "pinentry-mac"

cask "aldente" # Battery management
cask "stats" # System monitoring
cask "visual-studio-code"
cask "shottr"   # Screenshot utility
cask "rectangle" # Window manager
cask "scroll-reverser" # To allow for natural scrolling on trackpad, but not on mouse


# VS Code Extensions

# Markdown & Documentation
vscode "bierner.github-markdown-preview"
vscode "yahyabatulu.vscode-markdown-alert"
vscode "davidanson.vscode-markdownlint"
vscode "yzhang.markdown-all-in-one"

# GitHub & Actions
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "me-dutour-mathieu.vscode-github-actions"

# Development Tools
vscode "esbenp.prettier-vscode"
vscode "rvest.vs-code-prettier-eslint"
vscode "redhat.vscode-yaml"
vscode "ms-vscode-remote.remote-containers"
vscode "hediet.vscode-drawio"
vscode "ryanluker.vscode-coverage-gutters"
vscode "SonarSource.sonarlint-vscode"
vscode "janisdd.vscode-edit-csv"
vscode "ms-azuretools.vscode-docker"

# Python
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"

# JavaScript
vscode "dbaeumer.vscode-eslint"
vscode "Orta.vscode-jest"
